Tekla Open API Reference for Tekla Structures 2025
AngleDimension.GetAngle Method
 Gets the angle value (in degrees).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double GetAngle()
Public Function GetAngle As Double
Return Value
Type: Double
The angle value.
See Also
Reference
AngleDimension Class
Tekla.Structures.Drawing Namespace